To-Do-List/app/controllers/tasks_controller.rb

    def create
      @task = Task.new(task_params)

      if @task.save
---
INSERT INTO "tasks" ("name", "description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Estudo "], ["description", "linda"], ["completed", 0], ["created_at", "2023-08-25 18:27:41.756631"], ["updated_at", "2023-08-25 18:27:41.756631"]]

    def update
      if @task.update(task_params)
---
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2023-08-25 18:28:37.401878"], ["id", 3]]